# running in /mnt/c/Users/skywa/OneDrive/Documents/accelerator_design/macc8/reports/20260711-173107_formal/fsm_props/src/
# read package + DUT + properties together so macc8_pkg:: resolves under vanilla Yosys
read -formal macc8_pkg.sv macc8_fsm.sv macc8_props_fsm.sv
prep -top macc8_props_fsm

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
