# running in /mnt/c/Users/skywa/OneDrive/Documents/accelerator_design/macc8/reports/20260711-173107_formal/handshake_props/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
